MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA412/mcu.h
extern volatile CCP5STATBITS CCP5STATbits __attribute__((__sfr__));

#define CCP5STATL CCP5STATL
extern volatile uint16_t CCP5STATL __attribute__((__sfr__));
__extension__ typedef struct tagCCP5STATLBITS {
  union {
    struct {
      uint16_t ICBNE:1;
      uint16_t ICOV:1;
      uint16_t ICDIS:1;
      uint16_t SCEVT:1;
      uint16_t ASEVT:1;
      uint16_t TRCLR:1;
      uint16_t TRSET:1;
      uint16_t CCPTRIG:1;
      uint16_t :2;
      uint16_t ICGARM:1;
    };
    struct {
      uint16_t :7;
      uint16_t TRIG:1;
    };
  };
} CCP5STATLBITS;
extern volatile CCP5STATLBITS CCP5STATLbits __attribute__((__sfr__));

#define CCP5STATH CCP5STATH
extern volatile uint16_t CCP5STATH __attribute__((__sfr__));
typedef struct tagCCP5STATHBITS {
  uint16_t RAWIP:1;
  uint16_t RBWIP:1;
  uint16_t TMRLWIP:1;
  uint16_t TMRHWIP:1;
  uint16_t PRLWIP:1;
} CCP5STATHBITS;
extern volatile CCP5STATHBITS CCP5STATHbits __attribute__((__sfr__));

#define CCP5TMRL CCP5TMRL
extern volatile uint16_t CCP5TMRL __attribute__((__sfr__));
#define CCP5TMRH CCP5TMRH
extern volatile uint16_t CCP5TMRH __attribute__((__sfr__));
#define CCP5PRL CCP5PRL
extern volatile uint16_t CCP5PRL __attribute__((__sfr__));
#define CCP5PRH CCP5PRH
extern volatile uint16_t CCP5PRH __attribute__((__sfr__));
#define CCP5RA CCP5RA
extern volatile uint16_t CCP5RA __attribute__((__sfr__));
#define CCP5RAL CCP5RAL
extern volatile uint16_t CCP5RAL __attribute__((__sfr__));
#define CCP5RAH CCP5RAH
extern volatile uint16_t CCP5RAH __attribute__((__sfr__));
#define CCP5RB CCP5RB
extern volatile uint16_t CCP5RB __attribute__((__sfr__));
#define CCP5RBL CCP5RBL
extern volatile uint16_t CCP5RBL __attribute__((__sfr__));
#define CCP5RBH CCP5RBH
extern volatile uint16_t CCP5RBH __attribute__((__sfr__));
#define CCP5BUFL CCP5BUFL
extern volatile uint16_t CCP5BUFL __attribute__((__sfr__));
#define CCP5BUFH CCP5BUFH
extern volatile uint16_t CCP5BUFH __attribute__((__sfr__));
#define CCP6CON1L CCP6CON1L
extern volatile uint16_t CCP6CON1L __attribute__((__sfr__));
__extension__ typedef struct tagCCP6CON1LBITS {
  union {
    struct {
      uint16_t MOD:4;
      uint16_t CCSEL:1;
      uint16_t T32:1;
      uint16_t TMRPS:2;
      uint16_t CLKSEL:3;
      uint16_t TMRSYNC:1;
      uint16_t CCPSLP:1;
      uint16_t CCPSIDL:1;
      uint16_t :1;
      uint16_t CCPON:1;
    };
    struct {
      uint16_t MOD0:1;
      uint16_t MOD1:1;
      uint16_t MOD2:1;
      uint16_t MOD3:1;
      uint16_t :1;
      uint16_t TMR32:1;
      uint16_t TMRPS0:1;
      uint16_t TMRPS1:1;
      uint16_t CLKSEL0:1;
      uint16_t CLKSEL1:1;
      uint16_t CLKSEL2:1;
    };
    struct {
      uint16_t CCPMOD:4;
    };
    struct {
      uint16_t CCPMOD0:1;
      uint16_t CCPMOD1:1;
      uint16_t CCPMOD2:1;
      uint16_t CCPMOD3:1;
    };
  };
} CCP6CON1LBITS;
extern volatile CCP6CON1LBITS CCP6CON1Lbits __attribute__((__sfr__));

#define CCP6CON1H CCP6CON1H
extern volatile uint16_t CCP6CON1H __attribute__((__sfr__));
__extension__ typedef struct tagCCP6CON1HBITS {
  union {
    struct {
      uint16_t SYNC:5;
      uint16_t ALTSYNC:1;
      uint16_t ONESHOT:1;
      uint16_t TRIGEN:1;
      uint16_t OPS:4;
      uint16_t :2;
      uint16_t RTRGEN:1;
      uint16_t OPSSRC:1;
    };
    struct {
      uint16_t SYNC0:1;
      uint16_t SYNC1:1;
      uint16_t SYNC2:1;
      uint16_t SYNC3:1;
      uint16_t SYNC4:1;
      uint16_t :3;
      uint16_t OPS0:1;
      uint16_t OPS1:1;
      uint16_t OPS2:1;
      uint16_t OPS3:1;
      uint16_t :3;
      uint16_t OPSRC:1;
    };
    struct {
      uint16_t :8;
      uint16_t IOPS:4;
    };
    struct {
      uint16_t :8;
      uint16_t IOPS0:1;
      uint16_t IOPS1:1;
      uint16_t IOPS2:1;
      uint16_t IOPS3:1;
    };
  };
} CCP6CON1HBITS;
extern volatile CCP6CON1HBITS CCP6CON1Hbits __attribute__((__sfr__));

#define CCP6CON2L CCP6CON2L
extern volatile uint16_t CCP6CON2L __attribute__((__sfr__));
__extension__ typedef struct tagCCP6CON2LBITS {
  union {
    struct {
      uint16_t ASDG:8;
      uint16_t :4;
      uint16_t SSDG:1;
      uint16_t :1;
      uint16_t ASDGM:1;
      uint16_t PWMRSEN:1;
    };
    struct {
      uint16_t ASDG0:1;
      uint16_t ASDG1:1;
      uint16_t ASDG2:1;
      uint16_t ASDG3:1;
      uint16_t ASDG4:1;
      uint16_t ASDG5:1;
      uint16_t ASDG6:1;
      uint16_t ASDG7:1;
    };
  };
} CCP6CON2LBITS;
extern volatile CCP6CON2LBITS CCP6CON2Lbits __attribute__((__sfr__));

#define CCP6CON2H CCP6CON2H
extern volatile uint16_t CCP6CON2H __attribute__((__sfr__));
__extension__ typedef struct tagCCP6CON2HBITS {
  union {
    struct {
      uint16_t ICS:3;
      uint16_t AUXOUT:2;
      uint16_t :1;
      uint16_t ICGSM:2;
      uint16_t OCAEN:1;
      uint16_t :6;
      uint16_t OENSYNC:1;
    };
    struct {
      uint16_t ICS0:1;
      uint16_t ICS1:1;
      uint16_t ICS2:1;
      uint16_t AUXOUT0:1;
      uint16_t AUXOUT1:1;
      uint16_t :1;
      uint16_t ICGSM0:1;
      uint16_t ICGSM1:1;
    };
    struct {
      uint16_t ICSEL:3;
    };
    struct {
      uint16_t ICSEL0:1;
      uint16_t ICSEL1:1;
      uint16_t ICSEL2:1;
    };
  };
} CCP6CON2HBITS;
extern volatile CCP6CON2HBITS CCP6CON2Hbits __attribute__((__sfr__));

#define CCP6CON3L CCP6CON3L
extern volatile uint16_t CCP6CON3L __attribute__((__sfr__));
__extension__ typedef struct tagCCP6CON3LBITS {
  union {
    struct {
      uint16_t DT:6;
    };
    struct {
      uint16_t DT0:1;
      uint16_t DT1:1;
      uint16_t DT2:1;
      uint16_t DT3:1;
      uint16_t DT4:1;
      uint16_t DT5:1;
    };
  };
} CCP6CON3LBITS;
extern volatile CCP6CON3LBITS CCP6CON3Lbits __attribute__((__sfr__));

#define CCP6CON3H CCP6CON3H
extern volatile uint16_t CCP6CON3H __attribute__((__sfr__));
__extension__ typedef struct tagCCP6CON3HBITS {
  union {
    struct {
      uint16_t :2;
      uint16_t PSSACE:2;
      uint16_t :1;
      uint16_t POLACE:1;
      uint16_t :2;
      uint16_t OUTM:3;
      uint16_t :1;
      uint16_t OSCNT:3;
      uint16_t OETRIG:1;
    };
    struct {
      uint16_t :2;
      uint16_t PSSACE0:1;
      uint16_t PSSACE1:1;
      uint16_t :4;
      uint16_t OUTM0:1;
      uint16_t OUTM1:1;
      uint16_t OUTM2:1;
      uint16_t :1;
      uint16_t OSCNT0:1;
      uint16_t OSCNT1:1;
      uint16_t OSCNT2:1;
    };
  };
} CCP6CON3HBITS;
extern volatile CCP6CON3HBITS CCP6CON3Hbits __attribute__((__sfr__));

#define CCP6STAT CCP6STAT
extern volatile uint16_t CCP6STAT __attribute__((__sfr__));
__extension__ typedef struct tagCCP6STATBITS {
  union {
    struct {
      uint16_t ICBNE:1;
      uint16_t ICOV:1;
      uint16_t ICDIS:1;
      uint16_t SCEVT:1;
      uint16_t ASEVT:1;
      uint16_t TRCLR:1;
      uint16_t TRSET:1;
      uint16_t CCPTRIG:1;
      uint16_t :2;
      uint16_t ICGARM:1;
    };
    struct {
      uint16_t :7;
      uint16_t TRIG:1;
    };
  };
} CCP6STATBITS;
extern volatile CCP6STATBITS CCP6STATbits __attribute__((__sfr__));

