MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA412/mcu.h
extern volatile IOCPDABITS IOCPDAbits __attribute__((__sfr__));

#define TRISB TRISB
extern volatile uint16_t TRISB __attribute__((__sfr__));
typedef struct tagTRISBBITS {
  uint16_t TRISB0:1;
  uint16_t TRISB1:1;
  uint16_t TRISB2:1;
  uint16_t TRISB3:1;
  uint16_t TRISB4:1;
  uint16_t TRISB5:1;
  uint16_t TRISB6:1;
  uint16_t TRISB7:1;
  uint16_t TRISB8:1;
  uint16_t TRISB9:1;
  uint16_t TRISB10:1;
  uint16_t TRISB11:1;
  uint16_t TRISB12:1;
  uint16_t TRISB13:1;
  uint16_t TRISB14:1;
  uint16_t TRISB15:1;
} TRISBBITS;
extern volatile TRISBBITS TRISBbits __attribute__((__sfr__));

#define PORTB PORTB
extern volatile uint16_t PORTB __attribute__((__sfr__));
typedef struct tagPORTBBITS {
  uint16_t RB0:1;
  uint16_t RB1:1;
  uint16_t RB2:1;
  uint16_t RB3:1;
  uint16_t RB4:1;
  uint16_t RB5:1;
  uint16_t RB6:1;
  uint16_t RB7:1;
  uint16_t RB8:1;
  uint16_t RB9:1;
  uint16_t RB10:1;
  uint16_t RB11:1;
  uint16_t RB12:1;
  uint16_t RB13:1;
  uint16_t RB14:1;
  uint16_t RB15:1;
} PORTBBITS;
extern volatile PORTBBITS PORTBbits __attribute__((__sfr__));

#define LATB LATB
extern volatile uint16_t LATB __attribute__((__sfr__));
typedef struct tagLATBBITS {
  uint16_t LATB0:1;
  uint16_t LATB1:1;
  uint16_t LATB2:1;
  uint16_t LATB3:1;
  uint16_t LATB4:1;
  uint16_t LATB5:1;
  uint16_t LATB6:1;
  uint16_t LATB7:1;
  uint16_t LATB8:1;
  uint16_t LATB9:1;
  uint16_t LATB10:1;
  uint16_t LATB11:1;
  uint16_t LATB12:1;
  uint16_t LATB13:1;
  uint16_t LATB14:1;
  uint16_t LATB15:1;
} LATBBITS;
extern volatile LATBBITS LATBbits __attribute__((__sfr__));

#define ODCB ODCB
extern volatile uint16_t ODCB __attribute__((__sfr__));
typedef struct tagODCBBITS {
  uint16_t ODCB0:1;
  uint16_t ODCB1:1;
  uint16_t ODCB2:1;
  uint16_t ODCB3:1;
  uint16_t ODCB4:1;
  uint16_t ODCB5:1;
  uint16_t ODCB6:1;
  uint16_t ODCB7:1;
  uint16_t ODCB8:1;
  uint16_t ODCB9:1;
  uint16_t ODCB10:1;
  uint16_t ODCB11:1;
  uint16_t ODCB12:1;
  uint16_t ODCB13:1;
  uint16_t ODCB14:1;
  uint16_t ODCB15:1;
} ODCBBITS;
extern volatile ODCBBITS ODCBbits __attribute__((__sfr__));

#define ANSB ANSB
extern volatile uint16_t ANSB __attribute__((__sfr__));
__extension__ typedef struct tagANSBBITS {
  union {
    struct {
      uint16_t ANSB0:1;
      uint16_t ANSB1:1;
      uint16_t ANSB2:1;
      uint16_t ANSB3:1;
      uint16_t ANSB4:1;
      uint16_t ANSB5:1;
      uint16_t ANSB6:1;
      uint16_t ANSB7:1;
      uint16_t ANSB8:1;
      uint16_t ANSB9:1;
      uint16_t ANSB10:1;
      uint16_t ANSB11:1;
      uint16_t ANSB12:1;
      uint16_t ANSB13:1;
      uint16_t ANSB14:1;
      uint16_t ANSB15:1;
    };
    struct {
      uint16_t ANSELB0:1;
      uint16_t ANSELB1:1;
      uint16_t ANSELB2:1;
      uint16_t ANSELB3:1;
      uint16_t ANSELB4:1;
      uint16_t ANSELB5:1;
      uint16_t ANSELB6:1;
      uint16_t ANSELB7:1;
      uint16_t ANSELB8:1;
      uint16_t ANSELB9:1;
      uint16_t ANSELB10:1;
      uint16_t ANSELB11:1;
      uint16_t ANSELB12:1;
      uint16_t ANSELB13:1;
      uint16_t ANSELB14:1;
      uint16_t ANSELB15:1;
    };
  };
} ANSBBITS;
extern volatile ANSBBITS ANSBbits __attribute__((__sfr__));

#define ANSELB ANSELB
extern volatile uint16_t ANSELB __attribute__((__sfr__));
__extension__ typedef struct tagANSELBBITS {
  union {
    struct {
      uint16_t ANSB0:1;
      uint16_t ANSB1:1;
      uint16_t ANSB2:1;
      uint16_t ANSB3:1;
      uint16_t ANSB4:1;
      uint16_t ANSB5:1;
      uint16_t ANSB6:1;
      uint16_t ANSB7:1;
      uint16_t ANSB8:1;
      uint16_t ANSB9:1;
      uint16_t ANSB10:1;
      uint16_t ANSB11:1;
      uint16_t ANSB12:1;
      uint16_t ANSB13:1;
      uint16_t ANSB14:1;
      uint16_t ANSB15:1;
    };
    struct {
      uint16_t ANSELB0:1;
      uint16_t ANSELB1:1;
      uint16_t ANSELB2:1;
      uint16_t ANSELB3:1;
      uint16_t ANSELB4:1;
      uint16_t ANSELB5:1;
      uint16_t ANSELB6:1;
      uint16_t ANSELB7:1;
      uint16_t ANSELB8:1;
      uint16_t ANSELB9:1;
      uint16_t ANSELB10:1;
      uint16_t ANSELB11:1;
      uint16_t ANSELB12:1;
      uint16_t ANSELB13:1;
      uint16_t ANSELB14:1;
      uint16_t ANSELB15:1;
    };
  };
} ANSELBBITS;
extern volatile ANSELBBITS ANSELBbits __attribute__((__sfr__));

#define IOCPB IOCPB
extern volatile uint16_t IOCPB __attribute__((__sfr__));
typedef struct tagIOCPBBITS {
  uint16_t IOCPB0:1;
  uint16_t IOCPB1:1;
  uint16_t IOCPB2:1;
  uint16_t IOCPB3:1;
  uint16_t IOCPB4:1;
  uint16_t IOCPB5:1;
  uint16_t IOCPB6:1;
  uint16_t IOCPB7:1;
  uint16_t IOCPB8:1;
  uint16_t IOCPB9:1;
  uint16_t IOCPB10:1;
  uint16_t IOCPB11:1;
  uint16_t IOCPB12:1;
  uint16_t IOCPB13:1;
  uint16_t IOCPB14:1;
  uint16_t IOCPB15:1;
} IOCPBBITS;
extern volatile IOCPBBITS IOCPBbits __attribute__((__sfr__));

#define IOCNB IOCNB
extern volatile uint16_t IOCNB __attribute__((__sfr__));
typedef struct tagIOCNBBITS {
  uint16_t IOCNB0:1;
  uint16_t IOCNB1:1;
  uint16_t IOCNB2:1;
  uint16_t IOCNB3:1;
  uint16_t IOCNB4:1;
  uint16_t IOCNB5:1;
  uint16_t IOCNB6:1;
  uint16_t IOCNB7:1;
  uint16_t IOCNB8:1;
  uint16_t IOCNB9:1;
  uint16_t IOCNB10:1;
  uint16_t IOCNB11:1;
  uint16_t IOCNB12:1;
  uint16_t IOCNB13:1;
  uint16_t IOCNB14:1;
  uint16_t IOCNB15:1;
} IOCNBBITS;
extern volatile IOCNBBITS IOCNBbits __attribute__((__sfr__));

#define IOCFB IOCFB
extern volatile uint16_t IOCFB __attribute__((__sfr__));
typedef struct tagIOCFBBITS {
  uint16_t IOCFB0:1;
  uint16_t IOCFB1:1;
  uint16_t IOCFB2:1;
  uint16_t IOCFB3:1;
  uint16_t IOCFB4:1;
  uint16_t IOCFB5:1;
  uint16_t IOCFB6:1;
  uint16_t IOCFB7:1;
  uint16_t IOCFB8:1;
  uint16_t IOCFB9:1;
  uint16_t IOCFB10:1;
  uint16_t IOCFB11:1;
  uint16_t IOCFB12:1;
  uint16_t IOCFB13:1;
  uint16_t IOCFB14:1;
  uint16_t IOCFB15:1;
} IOCFBBITS;
extern volatile IOCFBBITS IOCFBbits __attribute__((__sfr__));

#define CNPUB CNPUB
extern volatile uint16_t CNPUB __attribute__((__sfr__));
__extension__ typedef struct tagCNPUBBITS {
  union {
    struct {
      uint16_t IOCPB0:1;
      uint16_t IOCPB1:1;
      uint16_t IOCPB2:1;
      uint16_t IOCPB3:1;
      uint16_t IOCPB4:1;
      uint16_t IOCPB5:1;
      uint16_t IOCPB6:1;
      uint16_t IOCPB7:1;
      uint16_t IOCPB8:1;
      uint16_t IOCPB9:1;
      uint16_t IOCPB10:1;
      uint16_t IOCPB11:1;
      uint16_t IOCPB12:1;
      uint16_t IOCPB13:1;
      uint16_t IOCPB14:1;
      uint16_t IOCPB15:1;
    };
    struct {
      uint16_t IOCPUB0:1;
      uint16_t IOCPUB1:1;
      uint16_t IOCPUB2:1;
      uint16_t IOCPUB3:1;
      uint16_t IOCPUB4:1;
      uint16_t IOCPUB5:1;
      uint16_t IOCPUB6:1;
      uint16_t IOCPUB7:1;
      uint16_t IOCPUB8:1;
      uint16_t IOCPUB9:1;
      uint16_t IOCPUB10:1;
      uint16_t IOCPUB11:1;
      uint16_t IOCPUB12:1;
      uint16_t IOCPUB13:1;
      uint16_t IOCPUB14:1;
      uint16_t IOCPUB15:1;
    };
    struct {
      uint16_t CNPUB0:1;
      uint16_t CNPUB1:1;
      uint16_t CNPUB2:1;
      uint16_t CNPUB3:1;
      uint16_t CNPUB4:1;
      uint16_t CNPUB5:1;
      uint16_t CNPUB6:1;
      uint16_t CNPUB7:1;
      uint16_t CNPUB8:1;
      uint16_t CNPUB9:1;
      uint16_t CNPUB10:1;
      uint16_t CNPUB11:1;
      uint16_t CNPUB12:1;
      uint16_t CNPUB13:1;
      uint16_t CNPUB14:1;
      uint16_t CNPUB15:1;
    };
  };
} CNPUBBITS;
extern volatile CNPUBBITS CNPUBbits __attribute__((__sfr__));

#define IOCPUB IOCPUB
extern volatile uint16_t IOCPUB __attribute__((__sfr__));
__extension__ typedef struct tagIOCPUBBITS {
  union {
    struct {
      uint16_t IOCPB0:1;
      uint16_t IOCPB1:1;
      uint16_t IOCPB2:1;
      uint16_t IOCPB3:1;
      uint16_t IOCPB4:1;
      uint16_t IOCPB5:1;
      uint16_t IOCPB6:1;
      uint16_t IOCPB7:1;
      uint16_t IOCPB8:1;
      uint16_t IOCPB9:1;
      uint16_t IOCPB10:1;
      uint16_t IOCPB11:1;
      uint16_t IOCPB12:1;
      uint16_t IOCPB13:1;
      uint16_t IOCPB14:1;
      uint16_t IOCPB15:1;
    };
    struct {
      uint16_t IOCPUB0:1;
      uint16_t IOCPUB1:1;
      uint16_t IOCPUB2:1;
      uint16_t IOCPUB3:1;
      uint16_t IOCPUB4:1;
      uint16_t IOCPUB5:1;
      uint16_t IOCPUB6:1;
      uint16_t IOCPUB7:1;
      uint16_t IOCPUB8:1;
      uint16_t IOCPUB9:1;
      uint16_t IOCPUB10:1;
      uint16_t IOCPUB11:1;
      uint16_t IOCPUB12:1;
      uint16_t IOCPUB13:1;
      uint16_t IOCPUB14:1;
      uint16_t IOCPUB15:1;
    };
    struct {
      uint16_t CNPUB0:1;
      uint16_t CNPUB1:1;
      uint16_t CNPUB2:1;
      uint16_t CNPUB3:1;
      uint16_t CNPUB4:1;
      uint16_t CNPUB5:1;
      uint16_t CNPUB6:1;
      uint16_t CNPUB7:1;
      uint16_t CNPUB8:1;
      uint16_t CNPUB9:1;
      uint16_t CNPUB10:1;
      uint16_t CNPUB11:1;
      uint16_t CNPUB12:1;
      uint16_t CNPUB13:1;
      uint16_t CNPUB14:1;
      uint16_t CNPUB15:1;
    };
  };
} IOCPUBBITS;
extern volatile IOCPUBBITS IOCPUBbits __attribute__((__sfr__));

#define CNPDB CNPDB
extern volatile uint16_t CNPDB __attribute__((__sfr__));
__extension__ typedef struct tagCNPDBBITS {
  union {
    struct {
      uint16_t IOCPDB0:1;
      uint16_t IOCPDB1:1;
      uint16_t IOCPDB2:1;
      uint16_t IOCPDB3:1;
      uint16_t IOCPDB4:1;
      uint16_t IOCPDB5:1;
      uint16_t IOCPDB6:1;
      uint16_t IOCPDB7:1;
      uint16_t IOCPDB8:1;
      uint16_t IOCPDB9:1;
      uint16_t IOCPDB10:1;
      uint16_t IOCPDB11:1;
      uint16_t IOCPDB12:1;
      uint16_t IOCPDB13:1;
      uint16_t IOCPDB14:1;
      uint16_t IOCPDB15:1;
    };
    struct {
      uint16_t CNPDB0:1;
      uint16_t CNPDB1:1;
      uint16_t CNPDB2:1;
      uint16_t CNPDB3:1;
      uint16_t CNPDB4:1;
      uint16_t CNPDB5:1;
      uint16_t CNPDB6:1;
      uint16_t CNPDB7:1;
      uint16_t CNPDB8:1;
      uint16_t CNPDB9:1;
      uint16_t CNPDB10:1;
      uint16_t CNPDB11:1;
      uint16_t CNPDB12:1;
      uint16_t CNPDB13:1;
      uint16_t CNPDB14:1;
      uint16_t CNPDB15:1;
    };
  };
} CNPDBBITS;
extern volatile CNPDBBITS CNPDBbits __attribute__((__sfr__));

#define IOCPDB IOCPDB
extern volatile uint16_t IOCPDB __attribute__((__sfr__));
__extension__ typedef struct tagIOCPDBBITS {
  union {
    struct {
      uint16_t IOCPDB0:1;
      uint16_t IOCPDB1:1;
      uint16_t IOCPDB2:1;
      uint16_t IOCPDB3:1;
      uint16_t IOCPDB4:1;
      uint16_t IOCPDB5:1;
      uint16_t IOCPDB6:1;
      uint16_t IOCPDB7:1;
      uint16_t IOCPDB8:1;
      uint16_t IOCPDB9:1;
      uint16_t IOCPDB10:1;
      uint16_t IOCPDB11:1;
      uint16_t IOCPDB12:1;
      uint16_t IOCPDB13:1;
      uint16_t IOCPDB14:1;
      uint16_t IOCPDB15:1;
    };
    struct {
      uint16_t CNPDB0:1;
      uint16_t CNPDB1:1;
      uint16_t CNPDB2:1;
      uint16_t CNPDB3:1;
      uint16_t CNPDB4:1;
      uint16_t CNPDB5:1;
      uint16_t CNPDB6:1;
      uint16_t CNPDB7:1;
      uint16_t CNPDB8:1;
      uint16_t CNPDB9:1;
      uint16_t CNPDB10:1;
      uint16_t CNPDB11:1;
      uint16_t CNPDB12:1;
      uint16_t CNPDB13:1;
      uint16_t CNPDB14:1;
      uint16_t CNPDB15:1;
    };
  };
} IOCPDBBITS;
