MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA412/mcu.h
#define _CCP3STAT_ICGARM_POSITION                0x0000000A
#define _CCP3STAT_ICGARM_MASK                    0x00000400
#define _CCP3STAT_ICGARM_LENGTH                  0x00000001

#define _CCP3STAT_TRIG_POSITION                  0x00000007
#define _CCP3STAT_TRIG_MASK                      0x00000080
#define _CCP3STAT_TRIG_LENGTH                    0x00000001

#define _CCP3STATL_ICBNE_POSITION                0x00000000
#define _CCP3STATL_ICBNE_MASK                    0x00000001
#define _CCP3STATL_ICBNE_LENGTH                  0x00000001

#define _CCP3STATL_ICOV_POSITION                 0x00000001
#define _CCP3STATL_ICOV_MASK                     0x00000002
#define _CCP3STATL_ICOV_LENGTH                   0x00000001

#define _CCP3STATL_ICDIS_POSITION                0x00000002
#define _CCP3STATL_ICDIS_MASK                    0x00000004
#define _CCP3STATL_ICDIS_LENGTH                  0x00000001

#define _CCP3STATL_SCEVT_POSITION                0x00000003
#define _CCP3STATL_SCEVT_MASK                    0x00000008
#define _CCP3STATL_SCEVT_LENGTH                  0x00000001

#define _CCP3STATL_ASEVT_POSITION                0x00000004
#define _CCP3STATL_ASEVT_MASK                    0x00000010
#define _CCP3STATL_ASEVT_LENGTH                  0x00000001

#define _CCP3STATL_TRCLR_POSITION                0x00000005
#define _CCP3STATL_TRCLR_MASK                    0x00000020
#define _CCP3STATL_TRCLR_LENGTH                  0x00000001

#define _CCP3STATL_TRSET_POSITION                0x00000006
#define _CCP3STATL_TRSET_MASK                    0x00000040
#define _CCP3STATL_TRSET_LENGTH                  0x00000001

#define _CCP3STATL_CCPTRIG_POSITION              0x00000007
#define _CCP3STATL_CCPTRIG_MASK                  0x00000080
#define _CCP3STATL_CCPTRIG_LENGTH                0x00000001

#define _CCP3STATL_ICGARM_POSITION               0x0000000A
#define _CCP3STATL_ICGARM_MASK                   0x00000400
#define _CCP3STATL_ICGARM_LENGTH                 0x00000001

#define _CCP3STATL_TRIG_POSITION                 0x00000007
#define _CCP3STATL_TRIG_MASK                     0x00000080
#define _CCP3STATL_TRIG_LENGTH                   0x00000001

#define _CCP3STATH_RAWIP_POSITION                0x00000000
#define _CCP3STATH_RAWIP_MASK                    0x00000001
#define _CCP3STATH_RAWIP_LENGTH                  0x00000001

#define _CCP3STATH_RBWIP_POSITION                0x00000001
#define _CCP3STATH_RBWIP_MASK                    0x00000002
#define _CCP3STATH_RBWIP_LENGTH                  0x00000001

#define _CCP3STATH_TMRLWIP_POSITION              0x00000002
#define _CCP3STATH_TMRLWIP_MASK                  0x00000004
#define _CCP3STATH_TMRLWIP_LENGTH                0x00000001

#define _CCP3STATH_TMRHWIP_POSITION              0x00000003
#define _CCP3STATH_TMRHWIP_MASK                  0x00000008
#define _CCP3STATH_TMRHWIP_LENGTH                0x00000001

#define _CCP3STATH_PRLWIP_POSITION               0x00000004
#define _CCP3STATH_PRLWIP_MASK                   0x00000010
#define _CCP3STATH_PRLWIP_LENGTH                 0x00000001

#define _CMSTAT_C1OUT_POSITION                   0x00000000
#define _CMSTAT_C1OUT_MASK                       0x00000001
#define _CMSTAT_C1OUT_LENGTH                     0x00000001

#define _CMSTAT_C2OUT_POSITION                   0x00000001
#define _CMSTAT_C2OUT_MASK                       0x00000002
#define _CMSTAT_C2OUT_LENGTH                     0x00000001

#define _CMSTAT_C3OUT_POSITION                   0x00000002
#define _CMSTAT_C3OUT_MASK                       0x00000004
#define _CMSTAT_C3OUT_LENGTH                     0x00000001

#define _CMSTAT_C1EVT_POSITION                   0x00000008
#define _CMSTAT_C1EVT_MASK                       0x00000100
#define _CMSTAT_C1EVT_LENGTH                     0x00000001

#define _CMSTAT_C2EVT_POSITION                   0x00000009
#define _CMSTAT_C2EVT_MASK                       0x00000200
#define _CMSTAT_C2EVT_LENGTH                     0x00000001

#define _CMSTAT_C3EVT_POSITION                   0x0000000A
#define _CMSTAT_C3EVT_MASK                       0x00000400
#define _CMSTAT_C3EVT_LENGTH                     0x00000001

#define _CMSTAT_CMIDL_POSITION                   0x0000000F
#define _CMSTAT_CMIDL_MASK                       0x00008000
#define _CMSTAT_CMIDL_LENGTH                     0x00000001

#define _CMSTAT_CMSIDL_POSITION                  0x0000000F
#define _CMSTAT_CMSIDL_MASK                      0x00008000
#define _CMSTAT_CMSIDL_LENGTH                    0x00000001

#define _CVRCON_CVR_POSITION                     0x00000000
#define _CVRCON_CVR_MASK                         0x0000001F
#define _CVRCON_CVR_LENGTH                       0x00000005

#define _CVRCON_CVRSS_POSITION                   0x00000005
#define _CVRCON_CVRSS_MASK                       0x00000020
#define _CVRCON_CVRSS_LENGTH                     0x00000001

#define _CVRCON_CVROE_POSITION                   0x00000006
#define _CVRCON_CVROE_MASK                       0x00000040
#define _CVRCON_CVROE_LENGTH                     0x00000001

#define _CVRCON_CVREN_POSITION                   0x00000007
#define _CVRCON_CVREN_MASK                       0x00000080
#define _CVRCON_CVREN_LENGTH                     0x00000001

#define _CVRCON_CVREFM_POSITION                  0x00000008
#define _CVRCON_CVREFM_MASK                      0x00000300
#define _CVRCON_CVREFM_LENGTH                    0x00000002

#define _CVRCON_CVREFP_POSITION                  0x0000000A
#define _CVRCON_CVREFP_MASK                      0x00000400
#define _CVRCON_CVREFP_LENGTH                    0x00000001

#define _CVRCON_CVR0_POSITION                    0x00000000
#define _CVRCON_CVR0_MASK                        0x00000001
#define _CVRCON_CVR0_LENGTH                      0x00000001

#define _CVRCON_CVR1_POSITION                    0x00000001
#define _CVRCON_CVR1_MASK                        0x00000002
#define _CVRCON_CVR1_LENGTH                      0x00000001

#define _CVRCON_CVR2_POSITION                    0x00000002
#define _CVRCON_CVR2_MASK                        0x00000004
#define _CVRCON_CVR2_LENGTH                      0x00000001

#define _CVRCON_CVR3_POSITION                    0x00000003
#define _CVRCON_CVR3_MASK                        0x00000008
#define _CVRCON_CVR3_LENGTH                      0x00000001

#define _CVRCON_CVR4_POSITION                    0x00000004
#define _CVRCON_CVR4_MASK                        0x00000010
#define _CVRCON_CVR4_LENGTH                      0x00000001

