MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA412/mcu.h
#define _LCDDATA28_S02C7_POSITION                0x00000002
#define _LCDDATA28_S02C7_MASK                    0x00000004
#define _LCDDATA28_S02C7_LENGTH                  0x00000001

#define _LCDDATA28_S03C7_POSITION                0x00000003
#define _LCDDATA28_S03C7_MASK                    0x00000008
#define _LCDDATA28_S03C7_LENGTH                  0x00000001

#define _LCDDATA28_S04C7_POSITION                0x00000004
#define _LCDDATA28_S04C7_MASK                    0x00000010
#define _LCDDATA28_S04C7_LENGTH                  0x00000001

#define _LCDDATA28_S05C7_POSITION                0x00000005
#define _LCDDATA28_S05C7_MASK                    0x00000020
#define _LCDDATA28_S05C7_LENGTH                  0x00000001

#define _LCDDATA28_S06C7_POSITION                0x00000006
#define _LCDDATA28_S06C7_MASK                    0x00000040
#define _LCDDATA28_S06C7_LENGTH                  0x00000001

#define _LCDDATA28_S07C7_POSITION                0x00000007
#define _LCDDATA28_S07C7_MASK                    0x00000080
#define _LCDDATA28_S07C7_LENGTH                  0x00000001

#define _LCDDATA28_S08C7_POSITION                0x00000008
#define _LCDDATA28_S08C7_MASK                    0x00000100
#define _LCDDATA28_S08C7_LENGTH                  0x00000001

#define _LCDDATA28_S09C7_POSITION                0x00000009
#define _LCDDATA28_S09C7_MASK                    0x00000200
#define _LCDDATA28_S09C7_LENGTH                  0x00000001

#define _LCDDATA28_S10C7_POSITION                0x0000000A
#define _LCDDATA28_S10C7_MASK                    0x00000400
#define _LCDDATA28_S10C7_LENGTH                  0x00000001

#define _LCDDATA28_S11C7_POSITION                0x0000000B
#define _LCDDATA28_S11C7_MASK                    0x00000800
#define _LCDDATA28_S11C7_LENGTH                  0x00000001

#define _LCDDATA28_S12C7_POSITION                0x0000000C
#define _LCDDATA28_S12C7_MASK                    0x00001000
#define _LCDDATA28_S12C7_LENGTH                  0x00000001

#define _LCDDATA28_S13C7_POSITION                0x0000000D
#define _LCDDATA28_S13C7_MASK                    0x00002000
#define _LCDDATA28_S13C7_LENGTH                  0x00000001

#define _LCDDATA28_S14C7_POSITION                0x0000000E
#define _LCDDATA28_S14C7_MASK                    0x00004000
#define _LCDDATA28_S14C7_LENGTH                  0x00000001

#define _LCDDATA28_S15C7_POSITION                0x0000000F
#define _LCDDATA28_S15C7_MASK                    0x00008000
#define _LCDDATA28_S15C7_LENGTH                  0x00000001

#define _LCDDATA29_S16C7_POSITION                0x00000000
#define _LCDDATA29_S16C7_MASK                    0x00000001
#define _LCDDATA29_S16C7_LENGTH                  0x00000001

#define _LCDDATA29_S17C7_POSITION                0x00000001
#define _LCDDATA29_S17C7_MASK                    0x00000002
#define _LCDDATA29_S17C7_LENGTH                  0x00000001

#define _LCDDATA29_S18C7_POSITION                0x00000002
#define _LCDDATA29_S18C7_MASK                    0x00000004
#define _LCDDATA29_S18C7_LENGTH                  0x00000001

#define _LCDDATA29_S19C7_POSITION                0x00000003
#define _LCDDATA29_S19C7_MASK                    0x00000008
#define _LCDDATA29_S19C7_LENGTH                  0x00000001

#define _LCDDATA29_S20C7_POSITION                0x00000004
#define _LCDDATA29_S20C7_MASK                    0x00000010
#define _LCDDATA29_S20C7_LENGTH                  0x00000001

#define _LCDDATA29_S21C7_POSITION                0x00000005
#define _LCDDATA29_S21C7_MASK                    0x00000020
#define _LCDDATA29_S21C7_LENGTH                  0x00000001

#define _LCDDATA29_S22C7_POSITION                0x00000006
#define _LCDDATA29_S22C7_MASK                    0x00000040
#define _LCDDATA29_S22C7_LENGTH                  0x00000001

#define _LCDDATA29_S23C7_POSITION                0x00000007
#define _LCDDATA29_S23C7_MASK                    0x00000080
#define _LCDDATA29_S23C7_LENGTH                  0x00000001

#define _LCDDATA29_S24C7_POSITION                0x00000008
#define _LCDDATA29_S24C7_MASK                    0x00000100
#define _LCDDATA29_S24C7_LENGTH                  0x00000001

#define _LCDDATA29_S25C7_POSITION                0x00000009
#define _LCDDATA29_S25C7_MASK                    0x00000200
#define _LCDDATA29_S25C7_LENGTH                  0x00000001

#define _LCDDATA29_S26C7_POSITION                0x0000000A
#define _LCDDATA29_S26C7_MASK                    0x00000400
#define _LCDDATA29_S26C7_LENGTH                  0x00000001

#define _LCDDATA29_S27C7_POSITION                0x0000000B
#define _LCDDATA29_S27C7_MASK                    0x00000800
#define _LCDDATA29_S27C7_LENGTH                  0x00000001

#define _LCDDATA29_S28C7_POSITION                0x0000000C
#define _LCDDATA29_S28C7_MASK                    0x00001000
#define _LCDDATA29_S28C7_LENGTH                  0x00000001

#define _LCDDATA29_S29C7_POSITION                0x0000000D
#define _LCDDATA29_S29C7_MASK                    0x00002000
#define _LCDDATA29_S29C7_LENGTH                  0x00000001

#define _LCDDATA29_S30C7_POSITION                0x0000000E
#define _LCDDATA29_S30C7_MASK                    0x00004000
#define _LCDDATA29_S30C7_LENGTH                  0x00000001

#define _LCDDATA29_S31C7_POSITION                0x0000000F
#define _LCDDATA29_S31C7_MASK                    0x00008000
#define _LCDDATA29_S31C7_LENGTH                  0x00000001

#define _LCDDATA30_S32C7_POSITION                0x00000000
#define _LCDDATA30_S32C7_MASK                    0x00000001
#define _LCDDATA30_S32C7_LENGTH                  0x00000001

#define _LCDDATA30_S33C7_POSITION                0x00000001
#define _LCDDATA30_S33C7_MASK                    0x00000002
#define _LCDDATA30_S33C7_LENGTH                  0x00000001

#define _LCDDATA30_S34C7_POSITION                0x00000002
#define _LCDDATA30_S34C7_MASK                    0x00000004
#define _LCDDATA30_S34C7_LENGTH                  0x00000001

#define _LCDDATA30_S35C7_POSITION                0x00000003
#define _LCDDATA30_S35C7_MASK                    0x00000008
#define _LCDDATA30_S35C7_LENGTH                  0x00000001

#define _LCDDATA30_S36C7_POSITION                0x00000004
#define _LCDDATA30_S36C7_MASK                    0x00000010
#define _LCDDATA30_S36C7_LENGTH                  0x00000001

#define _LCDDATA30_S37C7_POSITION                0x00000005
#define _LCDDATA30_S37C7_MASK                    0x00000020
#define _LCDDATA30_S37C7_LENGTH                  0x00000001

#define _LCDDATA30_S38C7_POSITION                0x00000006
#define _LCDDATA30_S38C7_MASK                    0x00000040
#define _LCDDATA30_S38C7_LENGTH                  0x00000001

#define _LCDDATA30_S39C7_POSITION                0x00000007
#define _LCDDATA30_S39C7_MASK                    0x00000080
#define _LCDDATA30_S39C7_LENGTH                  0x00000001

#define _LCDDATA30_S40C7_POSITION                0x00000008
#define _LCDDATA30_S40C7_MASK                    0x00000100
#define _LCDDATA30_S40C7_LENGTH                  0x00000001

#define _LCDDATA30_S41C7_POSITION                0x00000009
#define _LCDDATA30_S41C7_MASK                    0x00000200
#define _LCDDATA30_S41C7_LENGTH                  0x00000001

#define _LCDDATA30_S42C7_POSITION                0x0000000A
#define _LCDDATA30_S42C7_MASK                    0x00000400
#define _LCDDATA30_S42C7_LENGTH                  0x00000001

#define _LCDDATA30_S43C7_POSITION                0x0000000B
#define _LCDDATA30_S43C7_MASK                    0x00000800
#define _LCDDATA30_S43C7_LENGTH                  0x00000001

#define _LCDDATA30_S44C7_POSITION                0x0000000C
#define _LCDDATA30_S44C7_MASK                    0x00001000
#define _LCDDATA30_S44C7_LENGTH                  0x00000001

