MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA412/mcu.h
#define _CNPDF_IOCPDF2_POSITION                  0x00000002
#define _CNPDF_IOCPDF2_MASK                      0x00000004
#define _CNPDF_IOCPDF2_LENGTH                    0x00000001

#define _CNPDF_IOCPDF3_POSITION                  0x00000003
#define _CNPDF_IOCPDF3_MASK                      0x00000008
#define _CNPDF_IOCPDF3_LENGTH                    0x00000001

#define _CNPDF_IOCPDF4_POSITION                  0x00000004
#define _CNPDF_IOCPDF4_MASK                      0x00000010
#define _CNPDF_IOCPDF4_LENGTH                    0x00000001

#define _CNPDF_IOCPDF5_POSITION                  0x00000005
#define _CNPDF_IOCPDF5_MASK                      0x00000020
#define _CNPDF_IOCPDF5_LENGTH                    0x00000001

#define _CNPDF_IOCPDF6_POSITION                  0x00000006
#define _CNPDF_IOCPDF6_MASK                      0x00000040
#define _CNPDF_IOCPDF6_LENGTH                    0x00000001

#define _CNPDF_IOCPDF7_POSITION                  0x00000007
#define _CNPDF_IOCPDF7_MASK                      0x00000080
#define _CNPDF_IOCPDF7_LENGTH                    0x00000001

#define _CNPDF_IOCPDF8_POSITION                  0x00000008
#define _CNPDF_IOCPDF8_MASK                      0x00000100
#define _CNPDF_IOCPDF8_LENGTH                    0x00000001

#define _CNPDF_IOCPDF12_POSITION                 0x0000000C
#define _CNPDF_IOCPDF12_MASK                     0x00001000
#define _CNPDF_IOCPDF12_LENGTH                   0x00000001

#define _CNPDF_IOCPDF13_POSITION                 0x0000000D
#define _CNPDF_IOCPDF13_MASK                     0x00002000
#define _CNPDF_IOCPDF13_LENGTH                   0x00000001

#define _CNPDF_CNPDF0_POSITION                   0x00000000
#define _CNPDF_CNPDF0_MASK                       0x00000001
#define _CNPDF_CNPDF0_LENGTH                     0x00000001

#define _CNPDF_CNPDF1_POSITION                   0x00000001
#define _CNPDF_CNPDF1_MASK                       0x00000002
#define _CNPDF_CNPDF1_LENGTH                     0x00000001

#define _CNPDF_CNPDF2_POSITION                   0x00000002
#define _CNPDF_CNPDF2_MASK                       0x00000004
#define _CNPDF_CNPDF2_LENGTH                     0x00000001

#define _CNPDF_CNPDF3_POSITION                   0x00000003
#define _CNPDF_CNPDF3_MASK                       0x00000008
#define _CNPDF_CNPDF3_LENGTH                     0x00000001

#define _CNPDF_CNPDF4_POSITION                   0x00000004
#define _CNPDF_CNPDF4_MASK                       0x00000010
#define _CNPDF_CNPDF4_LENGTH                     0x00000001

#define _CNPDF_CNPDF5_POSITION                   0x00000005
#define _CNPDF_CNPDF5_MASK                       0x00000020
#define _CNPDF_CNPDF5_LENGTH                     0x00000001

#define _CNPDF_CNPDF6_POSITION                   0x00000006
#define _CNPDF_CNPDF6_MASK                       0x00000040
#define _CNPDF_CNPDF6_LENGTH                     0x00000001

#define _CNPDF_CNPDF7_POSITION                   0x00000007
#define _CNPDF_CNPDF7_MASK                       0x00000080
#define _CNPDF_CNPDF7_LENGTH                     0x00000001

#define _CNPDF_CNPDF8_POSITION                   0x00000008
#define _CNPDF_CNPDF8_MASK                       0x00000100
#define _CNPDF_CNPDF8_LENGTH                     0x00000001

#define _CNPDF_CNPDF12_POSITION                  0x0000000C
#define _CNPDF_CNPDF12_MASK                      0x00001000
#define _CNPDF_CNPDF12_LENGTH                    0x00000001

#define _CNPDF_CNPDF13_POSITION                  0x0000000D
#define _CNPDF_CNPDF13_MASK                      0x00002000
#define _CNPDF_CNPDF13_LENGTH                    0x00000001

#define _IOCPDF_IOCPDF0_POSITION                 0x00000000
#define _IOCPDF_IOCPDF0_MASK                     0x00000001
#define _IOCPDF_IOCPDF0_LENGTH                   0x00000001

#define _IOCPDF_IOCPDF1_POSITION                 0x00000001
#define _IOCPDF_IOCPDF1_MASK                     0x00000002
#define _IOCPDF_IOCPDF1_LENGTH                   0x00000001

#define _IOCPDF_IOCPDF2_POSITION                 0x00000002
#define _IOCPDF_IOCPDF2_MASK                     0x00000004
#define _IOCPDF_IOCPDF2_LENGTH                   0x00000001

#define _IOCPDF_IOCPDF3_POSITION                 0x00000003
#define _IOCPDF_IOCPDF3_MASK                     0x00000008
#define _IOCPDF_IOCPDF3_LENGTH                   0x00000001

#define _IOCPDF_IOCPDF4_POSITION                 0x00000004
#define _IOCPDF_IOCPDF4_MASK                     0x00000010
#define _IOCPDF_IOCPDF4_LENGTH                   0x00000001

#define _IOCPDF_IOCPDF5_POSITION                 0x00000005
#define _IOCPDF_IOCPDF5_MASK                     0x00000020
#define _IOCPDF_IOCPDF5_LENGTH                   0x00000001

#define _IOCPDF_IOCPDF6_POSITION                 0x00000006
#define _IOCPDF_IOCPDF6_MASK                     0x00000040
#define _IOCPDF_IOCPDF6_LENGTH                   0x00000001

#define _IOCPDF_IOCPDF7_POSITION                 0x00000007
#define _IOCPDF_IOCPDF7_MASK                     0x00000080
#define _IOCPDF_IOCPDF7_LENGTH                   0x00000001

#define _IOCPDF_IOCPDF8_POSITION                 0x00000008
#define _IOCPDF_IOCPDF8_MASK                     0x00000100
#define _IOCPDF_IOCPDF8_LENGTH                   0x00000001

#define _IOCPDF_IOCPDF12_POSITION                0x0000000C
#define _IOCPDF_IOCPDF12_MASK                    0x00001000
#define _IOCPDF_IOCPDF12_LENGTH                  0x00000001

#define _IOCPDF_IOCPDF13_POSITION                0x0000000D
#define _IOCPDF_IOCPDF13_MASK                    0x00002000
#define _IOCPDF_IOCPDF13_LENGTH                  0x00000001

#define _IOCPDF_CNPDF0_POSITION                  0x00000000
#define _IOCPDF_CNPDF0_MASK                      0x00000001
#define _IOCPDF_CNPDF0_LENGTH                    0x00000001

#define _IOCPDF_CNPDF1_POSITION                  0x00000001
#define _IOCPDF_CNPDF1_MASK                      0x00000002
#define _IOCPDF_CNPDF1_LENGTH                    0x00000001

#define _IOCPDF_CNPDF2_POSITION                  0x00000002
#define _IOCPDF_CNPDF2_MASK                      0x00000004
#define _IOCPDF_CNPDF2_LENGTH                    0x00000001

