MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ256GA412/mcu.h
#define _ANSELG_ANSELG12_POSITION                0x0000000C
#define _ANSELG_ANSELG12_MASK                    0x00001000
#define _ANSELG_ANSELG12_LENGTH                  0x00000001

#define _ANSELG_ANSELG13_POSITION                0x0000000D
#define _ANSELG_ANSELG13_MASK                    0x00002000
#define _ANSELG_ANSELG13_LENGTH                  0x00000001

#define _ANSELG_ANSELG14_POSITION                0x0000000E
#define _ANSELG_ANSELG14_MASK                    0x00004000
#define _ANSELG_ANSELG14_LENGTH                  0x00000001

#define _ANSELG_ANSELG15_POSITION                0x0000000F
#define _ANSELG_ANSELG15_MASK                    0x00008000
#define _ANSELG_ANSELG15_LENGTH                  0x00000001

#define _ANSG_ANSG0_POSITION                     0x00000000
#define _ANSG_ANSG0_MASK                         0x00000001
#define _ANSG_ANSG0_LENGTH                       0x00000001

#define _ANSG_ANSG1_POSITION                     0x00000001
#define _ANSG_ANSG1_MASK                         0x00000002
#define _ANSG_ANSG1_LENGTH                       0x00000001

#define _ANSG_ANSG6_POSITION                     0x00000006
#define _ANSG_ANSG6_MASK                         0x00000040
#define _ANSG_ANSG6_LENGTH                       0x00000001

#define _ANSG_ANSG7_POSITION                     0x00000007
#define _ANSG_ANSG7_MASK                         0x00000080
#define _ANSG_ANSG7_LENGTH                       0x00000001

#define _ANSG_ANSG8_POSITION                     0x00000008
#define _ANSG_ANSG8_MASK                         0x00000100
#define _ANSG_ANSG8_LENGTH                       0x00000001

#define _ANSG_ANSG9_POSITION                     0x00000009
#define _ANSG_ANSG9_MASK                         0x00000200
#define _ANSG_ANSG9_LENGTH                       0x00000001

#define _ANSG_ANSG12_POSITION                    0x0000000C
#define _ANSG_ANSG12_MASK                        0x00001000
#define _ANSG_ANSG12_LENGTH                      0x00000001

#define _ANSG_ANSG13_POSITION                    0x0000000D
#define _ANSG_ANSG13_MASK                        0x00002000
#define _ANSG_ANSG13_LENGTH                      0x00000001

#define _ANSG_ANSG14_POSITION                    0x0000000E
#define _ANSG_ANSG14_MASK                        0x00004000
#define _ANSG_ANSG14_LENGTH                      0x00000001

#define _ANSG_ANSG15_POSITION                    0x0000000F
#define _ANSG_ANSG15_MASK                        0x00008000
#define _ANSG_ANSG15_LENGTH                      0x00000001

#define _ANSG_ANSELG0_POSITION                   0x00000000
#define _ANSG_ANSELG0_MASK                       0x00000001
#define _ANSG_ANSELG0_LENGTH                     0x00000001

#define _ANSG_ANSELG1_POSITION                   0x00000001
#define _ANSG_ANSELG1_MASK                       0x00000002
#define _ANSG_ANSELG1_LENGTH                     0x00000001

#define _ANSG_ANSELG6_POSITION                   0x00000006
#define _ANSG_ANSELG6_MASK                       0x00000040
#define _ANSG_ANSELG6_LENGTH                     0x00000001

#define _ANSG_ANSELG7_POSITION                   0x00000007
#define _ANSG_ANSELG7_MASK                       0x00000080
#define _ANSG_ANSELG7_LENGTH                     0x00000001

#define _ANSG_ANSELG8_POSITION                   0x00000008
#define _ANSG_ANSELG8_MASK                       0x00000100
#define _ANSG_ANSELG8_LENGTH                     0x00000001

#define _ANSG_ANSELG9_POSITION                   0x00000009
#define _ANSG_ANSELG9_MASK                       0x00000200
#define _ANSG_ANSELG9_LENGTH                     0x00000001

#define _ANSG_ANSELG12_POSITION                  0x0000000C
#define _ANSG_ANSELG12_MASK                      0x00001000
#define _ANSG_ANSELG12_LENGTH                    0x00000001

#define _ANSG_ANSELG13_POSITION                  0x0000000D
#define _ANSG_ANSELG13_MASK                      0x00002000
#define _ANSG_ANSELG13_LENGTH                    0x00000001

#define _ANSG_ANSELG14_POSITION                  0x0000000E
#define _ANSG_ANSELG14_MASK                      0x00004000
#define _ANSG_ANSELG14_LENGTH                    0x00000001

#define _ANSG_ANSELG15_POSITION                  0x0000000F
#define _ANSG_ANSELG15_MASK                      0x00008000
#define _ANSG_ANSELG15_LENGTH                    0x00000001

#define _IOCPG_IOCPG0_POSITION                   0x00000000
#define _IOCPG_IOCPG0_MASK                       0x00000001
#define _IOCPG_IOCPG0_LENGTH                     0x00000001

#define _IOCPG_IOCPG1_POSITION                   0x00000001
#define _IOCPG_IOCPG1_MASK                       0x00000002
#define _IOCPG_IOCPG1_LENGTH                     0x00000001

#define _IOCPG_IOCPG2_POSITION                   0x00000002
#define _IOCPG_IOCPG2_MASK                       0x00000004
#define _IOCPG_IOCPG2_LENGTH                     0x00000001

#define _IOCPG_IOCPG3_POSITION                   0x00000003
#define _IOCPG_IOCPG3_MASK                       0x00000008
#define _IOCPG_IOCPG3_LENGTH                     0x00000001

#define _IOCPG_IOCPG6_POSITION                   0x00000006
#define _IOCPG_IOCPG6_MASK                       0x00000040
#define _IOCPG_IOCPG6_LENGTH                     0x00000001

#define _IOCPG_IOCPG7_POSITION                   0x00000007
#define _IOCPG_IOCPG7_MASK                       0x00000080
#define _IOCPG_IOCPG7_LENGTH                     0x00000001

#define _IOCPG_IOCPG8_POSITION                   0x00000008
#define _IOCPG_IOCPG8_MASK                       0x00000100
#define _IOCPG_IOCPG8_LENGTH                     0x00000001

#define _IOCPG_IOCPG9_POSITION                   0x00000009
#define _IOCPG_IOCPG9_MASK                       0x00000200
#define _IOCPG_IOCPG9_LENGTH                     0x00000001

#define _IOCPG_IOCPG12_POSITION                  0x0000000C
#define _IOCPG_IOCPG12_MASK                      0x00001000
#define _IOCPG_IOCPG12_LENGTH                    0x00000001

#define _IOCPG_IOCPG13_POSITION                  0x0000000D
#define _IOCPG_IOCPG13_MASK                      0x00002000
#define _IOCPG_IOCPG13_LENGTH                    0x00000001

#define _IOCPG_IOCPG14_POSITION                  0x0000000E
#define _IOCPG_IOCPG14_MASK                      0x00004000
#define _IOCPG_IOCPG14_LENGTH                    0x00000001

#define _IOCPG_IOCPG15_POSITION                  0x0000000F
#define _IOCPG_IOCPG15_MASK                      0x00008000
#define _IOCPG_IOCPG15_LENGTH                    0x00000001

